report/stage_4/profiling/three_nodes/proxy_by_new_threadpool/wrk2_sharding_proxy_separated_put.txt
$ wrk2 -c 128 -t 8 -d 125s -R 50000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_sharding_proxy_separated_put.txt


Running 2m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.573ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.401ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.586ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.569ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.580ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.472ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.564ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.394ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.15ms   54.33ms   1.01s    99.03%
    Req/Sec     6.63k     1.04k   37.22k    82.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.34ms
 75.000%    1.89ms
 90.000%    2.79ms
 99.000%   48.42ms
 99.900%  891.90ms
 99.990%  995.33ms
 99.999%    1.01s 
100.000%    1.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.045     0.000000            1         1.00
       0.561     0.100000       576234         1.11
       0.759     0.200000      1149395         1.25
       0.947     0.300000      1724424         1.43
       1.138     0.400000      2299635         1.67
       1.338     0.500000      2875544         2.00
       1.440     0.550000      3161036         2.22
       1.544     0.600000      3449640         2.50
       1.650     0.650000      3737626         2.86
       1.763     0.700000      4024561         3.33
       1.894     0.750000      4310235         4.00
       1.972     0.775000      4453546         4.44
       2.065     0.800000      4598366         5.00
       2.179     0.825000      4742314         5.71
       2.323     0.850000      4884748         6.67
       2.519     0.875000      5028650         8.00
       2.645     0.887500      5100566         8.89
       2.793     0.900000      5172022        10.00
       2.971     0.912500      5244068        11.43
       3.183     0.925000      5315458        13.33
       3.447     0.937500      5387514        16.00
       3.607     0.943750      5423364        17.78
       3.795     0.950000      5459244        20.00
       4.019     0.956250      5495132        22.86
       4.299     0.962500      5530871        26.67
       4.679     0.968750      5567020        32.00
       4.927     0.971875      5584724        35.56
       5.243     0.975000      5602796        40.00
       5.647     0.978125      5620624        45.71
       6.247     0.981250      5638630        53.33
       7.283     0.984375      5656527        64.00
       8.303     0.985938      5665527        71.11
      10.943     0.987500      5674485        80.00
      25.215     0.989062      5683453        91.43
      75.647     0.990625      5692433       106.67
     140.927     0.992188      5701421       128.00
     198.783     0.992969      5705906       142.22
     289.279     0.993750      5710394       160.00
     378.879     0.994531      5714878       182.86
     470.271     0.995313      5719378       213.33
     559.103     0.996094      5723858       256.00
     603.135     0.996484      5726101       284.44
     647.679     0.996875      5728347       320.00
     694.271     0.997266      5730609       365.71
     738.303     0.997656      5732839       426.67
     782.335     0.998047      5735087       512.00
     804.863     0.998242      5736214       568.89
     827.903     0.998437      5737332       640.00
     850.431     0.998633      5738472       731.43
     872.447     0.998828      5739596       853.33
     894.975     0.999023      5740721      1024.00
     907.263     0.999121      5741277      1137.78
     917.503     0.999219      5741845      1280.00
     928.255     0.999316      5742381      1462.86
     940.031     0.999414      5742936      1706.67
     951.807     0.999512      5743512      2048.00
     956.415     0.999561      5743788      2275.56
     962.047     0.999609      5744074      2560.00
     968.191     0.999658      5744358      2925.71
     974.335     0.999707      5744630      3413.33
     980.991     0.999756      5744910      4096.00
     984.063     0.999780      5745058      4551.11
     986.111     0.999805      5745206      5120.00
     988.159     0.999829      5745325      5851.43
     990.207     0.999854      5745463      6826.67
     993.279     0.999878      5745618      8192.00
     994.815     0.999890      5745703      9102.22
     995.839     0.999902      5745768     10240.00
     996.863     0.999915      5745819     11702.86
     998.399     0.999927      5745897     13653.33
     999.935     0.999939      5745956     16384.00
    1000.959     0.999945      5745999     18204.44
    1001.471     0.999951      5746024     20480.00
    1002.495     0.999957      5746078     23405.71
    1003.007     0.999963      5746102     27306.67
    1004.031     0.999969      5746165     32768.00
    1004.031     0.999973      5746165     36408.89
    1004.031     0.999976      5746165     40960.00
    1004.543     0.999979      5746193     46811.43
    1005.055     0.999982      5746228     54613.33
    1005.055     0.999985      5746228     65536.00
    1005.055     0.999986      5746228     72817.78
    1005.567     0.999988      5746257     81920.00
    1005.567     0.999989      5746257     93622.86
    1005.567     0.999991      5746257    109226.67
    1006.079     0.999992      5746277    131072.00
    1006.079     0.999993      5746277    145635.56
    1006.079     0.999994      5746277    163840.00
    1006.079     0.999995      5746277    187245.71
    1006.079     0.999995      5746277    218453.33
    1006.591     0.999996      5746293    262144.00
    1006.591     0.999997      5746293    291271.11
    1006.591     0.999997      5746293    327680.00
    1006.591     0.999997      5746293    374491.43
    1006.591     0.999998      5746293    436906.67
    1006.591     0.999998      5746293    524288.00
    1006.591     0.999998      5746293    582542.22
    1007.103     0.999998      5746302    655360.00
    1007.103     1.000000      5746302          inf
#[Mean    =        6.146, StdDeviation   =       54.326]
#[Max     =     1006.592, Total count    =      5746302]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6247968 requests in 2.08m, 493.50MB read
  Non-2xx or 3xx responses: 45009
Requests/sec:  49983.09
Transfer/sec:      3.95MB